'''
Вам дана в архиве (ссылка) файловая структура, состоящая из директорий и файлов.

Вам необходимо распаковать этот архив, и затем найти в данной в файловой структуре все директории, в которых есть хотя бы один файл с расширением ".py".

Ответом на данную задачу будет являться файл со списком таких директорий, отсортированных в лексикографическом порядке.

Для лучшего понимания формата задачи, ознакомьтесь с примером.
'''

import os
import os.path
os.chdir('D:\programming Python\Stepik 01.20\задание directoria')
#print(os.getcwd())
d=[]
for x,y,z in os.walk("."):
    #print(x,y,z)
    for name in z:
        if name.endswith('.py'):
            d.append(x[2:])
            break


d.sort()
ds="\n".join(d)
f=open('dirtext.txt','w')
f.write(ds)
f.close()

